
&После("ОбработкаПроведения")
Процедура crm_ОбработкаПроведения(Отказ, РежимПроведения)
	
	////нужно проверить оплату и проверить статус чека "пробит"
	//Если crm_RetailCRMПовтИсп.ПолучитьЗначениеКонстанты("ВыгружатьЧек") = Истина Тогда
	//	Если ЭтотОбъект.Архивный = Истина Тогда
	//	Иначе 
	//		Если crm_RetailCRMПовтИсп.ПолучитьЗначениеКонстанты("ИспользованиеПЛ") = Ложь Тогда
	//			//если мы не используем ПЛ, то нам нужно выгружать только пробитые и оплаченные чеки
	//			Если ЭтотОбъект.Статус = Перечисления.СтатусыЧековККМ.Пробит Тогда
	//				Если ЭтотОбъект.ФормаОплаты = Перечисления.ФормыОплаты.Наличная Тогда
	//					Если ЭтотОбъект.ПолученоНаличными = ЭтотОбъект.ЭтотОбъект.СуммаДокумента Тогда
	//						Попытка
	//							crm_RetailCRMОбщий.ВыгрузитьЧекВCRM(ЭтотОбъект, Ложь, Неопределено, "ВыгрузитьЧекБезПЛ", Неопределено, Неопределено, Неопределено);
	//						Исключение
	//							Сообщить("Чек не был выгружен в RetailCRM");
	//						КонецПопытки;
	//					КонецЕсли;
	//				ИначеЕсли ЭтотОбъект.ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта Тогда
	//					СуммаОплаты = 0;
	//					Для Каждого Оплата из ЭтотОбъект.ОплатаПлатежнымиКартами Цикл 
	//						СуммаОплаты = СуммаОплаты + Оплата.Сумма; 	
	//					КонецЦикла;
	//					Если СуммаОплаты = ЭтотОбъект.ЭтотОбъект.СуммаДокумента Тогда
	//						Попытка
	//							crm_RetailCRMОбщий.ВыгрузитьЧекВCRM(ЭтотОбъект, Ложь, Неопределено, "ВыгрузитьЧекБезПЛ", Неопределено, Неопределено, Неопределено);
	//						Исключение
	//							Сообщить("Чек не был выгружен в RetailCRM");
	//						КонецПопытки;	
	//					КонецЕсли;
	//				КонецЕсли;
	//			КонецЕсли;
	//		Иначе 
	//			//если мы используем ПЛ, то нам нужно выгружать только пробитые и оплаченные чеки
	//			Если ЭтотОбъект.crm_ПЛ = Истина Тогда 
	//				Действие = "ВыгрузитьЧекСПЛ";
	//			Иначе 
	//				Действие = "ВыгрузитьЧекБезПЛ";
	//			КонецЕсли;
	//			
	//			Если ЭтотОбъект.Статус = Перечисления.СтатусыЧековККМ.Пробит Тогда
	//				//проверяем оплаты
	//				Если ЭтотОбъект.ФормаОплаты = Перечисления.ФормыОплаты.Наличная Тогда
	//					Если ЭтотОбъект.ПолученоНаличными = ЭтотОбъект.ЭтотОбъект.СуммаДокумента Тогда
	//						Попытка
	//							crm_RetailCRMОбщий.ВыгрузитьЧекВCRM(ЭтотОбъект, Ложь, Неопределено, Действие, Неопределено, Неопределено, Неопределено);
	//						Исключение
	//							Сообщить("Чек не был выгружен в RetailCRM");
	//						КонецПопытки;
	//					КонецЕсли;
	//				ИначеЕсли ЭтотОбъект.ФормаОплаты = Перечисления.ФормыОплаты.ПлатежнаяКарта Тогда
	//					СуммаОплаты = 0;
	//					Для Каждого Оплата из ЭтотОбъект.ОплатаПлатежнымиКартами Цикл 
	//						СуммаОплаты = СуммаОплаты + Оплата.Сумма; 	
	//					КонецЦикла;
	//					Если СуммаОплаты = ЭтотОбъект.ЭтотОбъект.СуммаДокумента Тогда
	//						Попытка
	//							crm_RetailCRMОбщий.ВыгрузитьЧекВCRM(ЭтотОбъект, Ложь, Неопределено, Действие, Неопределено, Неопределено, Неопределено);
	//						Исключение
	//							Сообщить("Чек не был выгружен в RetailCRM");
	//						КонецПопытки;
	//					КонецЕсли; 
	//				ИначеЕсли ЭтотОбъект.ФормаОплаты = Перечисления.ФормыОплаты.Безналичная Тогда
	//					
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;

КонецПроцедуры
