
&НаСервере
Процедура crm_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	Если crm_RetailCRMОбщий.ПолучитьЗначениеКонстанты("ВыгрузкаОплатВCRM") = Истина Тогда
		
		Свойство = Обработки.crm_RetailCRMОбработка.УТ11_ПолучитьСвойство("ИДоплаты", Справочники.НаборыДополнительныхРеквизитовИСведений.УдалитьДокумент_ОперацияПоПлатежнойКарте);
		ИДОплаты = Обработки.crm_RetailCRMОбработка.УТ11_ПолучитьЗначениеСвойстваОбъекта(ТекущийОбъект.Ссылка,Свойство);
		
		СвойствоТип = Обработки.crm_RetailCRMОбработка.УТ11_ПолучитьСвойство("ТипОплаты", Справочники.НаборыДополнительныхРеквизитовИСведений.УдалитьДокумент_ОперацияПоПлатежнойКарте);
		КодОплаты = Обработки.crm_RetailCRMОбработка.УТ11_ПолучитьЗначениеСвойстваОбъекта(ТекущийОбъект.Ссылка,СвойствоТип);
	
		ТипДокументаОплаты = "Эквайринговая операция";
		//если ИД пустой - создаем оплату, если заполнен - редактируем
		//Если Не ЗначениеЗаполнено(ИДОплаты) И Не ТекущийОбъект.Проведен Тогда
		//	Возврат;
		//КонецЕсли;
		
		Если ТекущийОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту 
			и crm_RetailCRMОбщий.ПолучитьЗначениеКонстанты("ВыгрузкаВозвратовОплатыВCRM") = Ложь Тогда
			Возврат;
		КонецЕсли;
			
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			//при пометке удаления отменяем оплату
			Отменить = Ложь;
			Если ТекущийОбъект.ПометкаУдаления Тогда 
				Отменить = Истина;
			КонецЕсли;
			Если ТекущийОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
				crm_RetailCRMОбщий.ВыгрузитьВозвратОплатыВCRM(ТекущийОбъект.Ссылка, Отменить, ИДОплаты,ТипДокументаОплаты, КодОплаты);
			Иначе 
				crm_RetailCRMОбщий.ВыгрузитьОплатуВCRM(ТекущийОбъект.Ссылка, Отменить, ИДОплаты,ТипДокументаОплаты, КодОплаты);
			КонецЕсли;
		ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Отменить = Истина;
			Если ТекущийОбъект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
				crm_RetailCRMОбщий.ВыгрузитьВозвратОплатыВCRM(ТекущийОбъект.Ссылка, Отменить, ИДОплаты,ТипДокументаОплаты, КодОплаты);
			Иначе 
				crm_RetailCRMОбщий.ВыгрузитьОплатуВCRM(ТекущийОбъект.Ссылка,Отменить,ИДОплаты,ТипДокументаОплаты, КодОплаты);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

