
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтатусУчастия 			= Параметры.Статус;
	idУчастия 				= Параметры.idУчастия;
	ТекущийУровень 			= Параметры.Уровень;
	СуммаПокупок 			= Параметры.СуммаПокупок;
	СуммаДоСледующегоУровня = Параметры.СуммаДоСледУровня;
	БонусовНаСчете 			= Параметры.Бонусы;
	Если Параметры.НомерКарты = Неопределено Тогда  
		НомерБонуснойКарты		= "Карта не привязана";
	Иначе 
		НомерБонуснойКарты		= Параметры.НомерКарты;
	КонецЕсли;
	ПривязанныйТелефон 		= Параметры.Телефон;
	ДатаРегистрации 		= Параметры.ДатаРегистрации;
	СуммаДляПерехода 		= Параметры.СуммаДоСледУровня;
	ОбычныеТовары 			= "" + Параметры.ОбычныеТовары + "%";
	АкционнныеТовары 		= "" + Параметры.АкционныеТовары + "%";

КонецПроцедуры
