
&НаСервере
Процедура crm_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	Если crm_RetailCRMПовтИсп.ПолучитьЗначениеКонстанты("ВыгрузкаВозвратов") = Истина Тогда
		Отменить = Ложь;
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			Если ТекущийОбъект.ПометкаУдаления Тогда 
				Отменить = Истина;
			КонецЕсли;	
			crm_RetailCRMОбщий.ВыгрузитьВозвратВCRM(ТекущийОбъект.Ссылка, Отменить);
		ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Отменить = Истина;
			crm_RetailCRMОбщий.ВыгрузитьВозвратВCRM(ТекущийОбъект.Ссылка,Отменить);
			//Сообщить("Отмена проведения не передается в RetailCRM в этой версии модуля");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
