
// ЕНС. Отключено, т.к. функционал не востребован
//&НаСервере
//Процедура crm_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
//	
//	Если crm_RetailCRMПовтИсп.ПолучитьЗначениеКонстанты("ВыгружатьЗаказы") = Истина Тогда
//		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
//			Если ТекущийОбъект.ПометкаУдаления Тогда 
//				Отменить = Истина;
//			КонецЕсли;	
//			crm_RetailCRMОбщий.ВыгрузитьЗаказВCRM(ТекущийОбъект.Ссылка, Отменить);
//		ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
//			Отменить = Истина;
//			crm_RetailCRMОбщий.ВыгрузитьЗаказВCRM(ТекущийОбъект.Ссылка,Отменить);
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры

// ЕНС. Отключено, т.к. функционал не востребован
//&НаКлиенте
//Процедура crm_ПриОткрытииПосле(Отказ)
//	
//	Если crm_RetailCRMПовтИсп.ПолучитьЗначениеКонстанты("ИспользованиеПЛ") = Ложь Тогда 
//   		Элементы.Товарыcrm_СкидкаПЛ.Видимость = Ложь;
//		Элементы.Товарыcrm_НачисленоПЛ.Видимость = Ложь;
//	КонецЕсли;
//	
//КонецПроцедуры
