
&НаКлиенте
Процедура Списать(Команда)
	
	Если КоличествоДляСписания > ДоступноДляСписания Тогда
		ПоказатьПредупреждение(,"Не может быть списано больше " + ДоступноДляСписания + " баллов.",);
	ИначеЕсли ДоступноДляСписания = 0 Тогда 
		ПоказатьПредупреждение(,"Отсутствуют баллы для списания.",);
	Иначе 
		//нужно создать заказ в crm и куда-нибудь записать его id
		Действие = "ВыгрузитьНовыйЧек";
		ДанныеЧека = Новый Структура; 
		ДанныеЧека.Вставить("НомерТелефона", НомерТелефона);
		ДанныеЧека.Вставить("IDКлиента", IDКлиента);
		ДанныеЧека.Вставить("Магазин", Магазин);
		ДанныеЧека.Вставить("ВидЦены", ВидЦены);
		ДанныеЧека.Вставить("КассаККМ", КассаККМ);
		ДанныеЧека.Вставить("Почта", Почта);
		
		ДанныеПЛ = Новый Структура;
		ДанныеПЛ.Вставить("ТипПривилегии", ТипПривилегии);
		ДанныеПЛ.Вставить("IDСкидкиПоСобытию", idСкидкиПоСобытию);
		ИдЗаказа = idЧека;
		
		ВыгрузитьЧекВCRM(Неопределено, Ложь, ДанныеПЛ, "ВыгрузитьНовыйЧек", ДанныеЧека, ИдЗаказа);
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("НомерТелефона", НомерТелефона);
		СтруктураВозврата.Вставить("НомерКарты", НомерКарты);
		СтруктураВозврата.Вставить("IDКлиента", IDКлиента);
		СтруктураВозврата.Вставить("КоличествоДляСписания", КоличествоДляСписания);
		СтруктураВозврата.Вставить("ИдЗаказа", ИдЗаказа);
		СтруктураВозврата.Вставить("Магазин", Магазин);
		ЭтаФорма.Закрыть(СтруктураВозврата);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВыгрузитьЧекВCRM(Чек, Отменить, ДанныеПЛ, Действие, ДанныеЧека, ИдЗаказа)

	СписокТоваров = РеквизитФормыВЗначение("Товары");
    ДанныеЧека.Вставить("Товары", Товары);
	crm_RetailCRMОбщий.ВыгрузитьЧекВCRM(Чек, Отменить, ДанныеПЛ, Действие, ДанныеЧека, ИдЗаказа, ФИО);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступноДляСписания =  Параметры.БонусыДляСписания;
	IDКлиента = Параметры.IDКлиента;
	НомерКарты = Параметры.НомерКарты;
	НомерТелефона = Параметры.ТелефонДляПроверки;
	Магазин = Параметры.Магазин;
	ТипПривилегии = Параметры.ТипПривилегии;
	ВидЦены = Параметры.ВидЦены;
	ФИО = Параметры.ФИО;
	idЧека = Параметры.idЧека;
	КассаККМ = Параметры.КассаККМ;
	Почта = Параметры.Почта;
	idСкидкиПоСобытию = Параметры.IDСкидкиПоСобытию;
	//Заполняем тч товары
	
	ТаблицаТоваров = Параметры.Товары.Выгрузить();
	
	СписокТоваровОб = РеквизитФормыВЗначение("Товары");
	СписокТоваровОб = ТаблицаТоваров;
	ЗначениеВРеквизитФормы(СписокТоваровОб, "Товары");
	
КонецПроцедуры

