
&НаСервере
Процедура crm_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	
	Если crm_RetailCRMОбщий.ПолучитьЗначениеКонстанты("ВыгружатьЗаказы") = Истина Тогда
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
			Если ТекущийОбъект.ПометкаУдаления Тогда 
				Отменить = Истина;
			КонецЕсли;	
			crm_RetailCRMОбщий.ВыгрузитьЗаказВCRM(ТекущийОбъект.Ссылка, Отменить);
		ИначеЕсли ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
			Отменить = Истина;
			crm_RetailCRMОбщий.ВыгрузитьЗаказВCRM(ТекущийОбъект.Ссылка,Отменить);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура crm_ПриОткрытииПосле(Отказ)
	
	Если crm_RetailCRMОбщий.ПолучитьЗначениеКонстанты("ИспользованиеПЛ") = Ложь Тогда 
   		Элементы.Товарыcrm_СкидкаПЛ.Видимость = Ложь;
		Элементы.Товарыcrm_НачисленоПЛ.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
