
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Телефон = Параметры.ТелефонДляПроверки;
	Фамилия = Параметры.Фамилия;
	Имя 	= Параметры.Имя;
	Отчество = Параметры.Отчество;
	ДатаРождения = Параметры.ДатаРождения;
	Если Параметры.Пол = "male" или Параметры.Пол = "М" Тогда 
		Пол = "М";	
	ИначеЕсли Параметры.Пол = "female" или Параметры.Пол = "Ж" Тогда 
		Пол = "Ж";	
	КонецЕсли;
	
	//заполним параметры
	КлиентСозданВCRM = Параметры.КлиентCRM;
	Если КлиентСозданВCRM Тогда 
		IDКлиента = Параметры.IDКлиента;
		ЭтаФорма.Элементы.Телефон.Доступность = Ложь;
	КонецЕсли;
	
	Магазин = Параметры.Магазин;
	//найдем клиента в 1С 
	Если ЗначениеЗаполнено(IDКлиента) Тогда 
		Контрагент = crm_RetailCRMОбработка.УТ11_ВернутьКонтрагентаПоID(Формат(Число(IDКлиента),"ЧГ="), "customer");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда 
		Контрагент = crm_RetailCRMОбработка.УТ11_ВернутьКонтрагентаПоТелефону_Почте("", Телефон);
		Если Не ЗначениеЗаполнено(Контрагент) и КлиентСозданВCRM = Истина Тогда
		//создадим клиента сначала в 1С
			Структура = Новый Структура;
			Структура.Вставить("Фамилия", 		Фамилия);
			Структура.Вставить("Имя", 			Имя);
			Структура.Вставить("Отчество", 		Отчество);
			Структура.Вставить("Телефон", 		Телефон);
			Структура.Вставить("Почта", 		eMail);
			Структура.Вставить("Пол", 			Пол);
			Структура.Вставить("ДатаРождения", 	ДатаРождения);
			Структура.Вставить("IDКлиента", 	Формат(Число(IDКлиента),"ЧГ="));
			Если ЗначениеЗаполнено(Параметры.ДатаСоздания) Тогда
				Структура.Вставить("ДатаСоздания", 	ТекущаяДата());
			Иначе 
				Структура.Вставить("ДатаСоздания", 	Параметры.ДатаСоздания);
			КонецЕсли;	
			КлиентПартнер = crm_RetailCRMОбщий.СоздатьКлиента1С(Структура);
			Партнер = КлиентПартнер.Получить("Партнер");
			Контрагент = КлиентПартнер.Получить("Клиент");
		КонецЕсли;
	Иначе 
		Партнер = Контрагент.Партнер;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) и не ЗначениеЗаполнено(Партнер) Тогда 
		Партнер = Контрагент.Партнер;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Партнер) Тогда 
		Если Не ЗначениеЗаполнено(ДатаРождения) и ЗначениеЗаполнено(Партнер.ДатаРождения) Тогда 
			ДатаРождения = Партнер.ДатаРождения;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Пол) и ЗначениеЗаполнено(Партнер.Пол) Тогда 
			Если Партнер.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда 
				Пол = "М";	
			ИначеЕсли Партнер.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда 
				Пол = "Ж";
			КонецЕсли;
		КонецЕсли;
		
		Массив = crm_RetailCRMОбщий.РазложитьСтрокуВМассивПодстрок(Партнер.НаименованиеПолное, " ", Истина);
		Для Индекс = 0 По Массив.Количество() - 1 Цикл
			Если Индекс = 0 Тогда 
				Фамилия = Массив[0];
			ИначеЕсли Индекс = 1 Тогда 
				Имя 	= Массив[1];
			ИначеЕсли  Индекс = 2 Тогда
				Отчество = Массив[2];
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьНаСервере()
	
	Если ЗначениеЗаполнено(Партнер) Тогда 
		Выборка = Новый Структура;
		Выборка.Вставить("ТелефонП", Телефон);
		Выборка.Вставить("Партнер", Партнер);
	КонецЕсли;
	
	ИмяСервера = СокрЛП(crm_RetailCRMОбщий.ПолучитьЗначениеКонстанты("ИмяСервера"));
	КлючCRM = СокрЛП(crm_RetailCRMОбщий.ПолучитьЗначениеКонстанты("КлючCRM"));
	
	Если Не КлиентСозданВCRM Тогда 
		//создаем клиента в crm
		Если НЕ ЗначениеЗаполнено(Партнер) Тогда 
			//создадим клиента сначала в 1С
			Структура = Новый Структура;
			Структура.Вставить("Фамилия", 		Фамилия);
			Структура.Вставить("Имя", 			Имя);
			Структура.Вставить("Отчество", 		Отчество);
			Структура.Вставить("Телефон", 		Телефон);
			Структура.Вставить("Почта", 		eMail);
			Структура.Вставить("Пол", 			Пол);
			Структура.Вставить("ДатаРождения", 	ДатаРождения);
			Структура.Вставить("ДатаСоздания", 	crm_RetailCRMОбщий.ПреобразоватьДатуCRM(ТекущаяДата()));
			Структура.Вставить("IDКлиента", 	"");
			КлиентПартнер = crm_RetailCRMОбщий.СоздатьКлиента1С(Структура);
			Партнер = КлиентПартнер.Получить("Партнер");
			Контрагент = КлиентПартнер.Получить("Клиент");
		КонецЕсли;
		
		ОтветСозд = Неопределено;
		Если ЗначениеЗаполнено(Партнер) Тогда
			Контрагент = Справочники.Контрагенты.НайтиПоРеквизиту("Партнер",Партнер);
			Выборка = Новый Структура;
			Выборка.Вставить("ТелефонП", 	Телефон);
			Выборка.Вставить("Партнер", 	Партнер);
			Выборка.Вставить("Контрагент", 	Контрагент);
			Выборка.Вставить("Пол", 		Пол);			
			Выборка.Вставить("ДатаРегистрации", Партнер.ДатаРегистрации);
            Выборка.Вставить("ДатаРождения", 	ДатаРождения);
			Выборка.Вставить("Почта", 		eMail);
			Выборка.Вставить("ПочтаП", 		eMail);
			Выборка.Вставить("Адрес", 		"");
		КонецЕсли;
		crm_RetailCRMОбщий.СоздатьКлиентаВCRM(Выборка, Ложь, Неопределено, Истина, Ложь, Магазин, ОтветСозд);

		Если ОтветСозд["success"] = Истина Тогда 
			//сохранять клиента в 1С пока не нужно
			КлиентСозданВCRM = Истина;
			IDКлиента = Формат(ОтветСозд["id"],"ЧГ=");
		КонецЕсли;
	КонецЕсли;
	
	Если КлиентСозданВCRM Тогда 
		//добавляем в ПЛ
		Успешно = Ложь;
		Активность = Ложь;
		ОтветРег = Неопределено;
		crm_RetailCRMОбщий.ЗарегистрироватьКлиентаВПЛCRM(Выборка, Успешно, Активность, Формат(Число(IDКлиента),"ЧГ="), Магазин, ОтветРег);
		
		Если Успешно Тогда 
			ДанныеКлиента = ОтветРег["loyaltyAccount"];
			
			Структура = Новый Структура;
			ФИО = Фамилия + " " + Имя + " " + Отчество;
			Если НЕ ЗначениеЗаполнено(ФИО) Тогда
				ФИО = "Клиент без имени";
			КонецЕсли;
			
			Структура.Вставить("ФИО", 			ФИО);
			Структура.Вставить("Телефон", 		ДанныеКлиента["phoneNumber"]);
			Структура.Вставить("УчастникПЛ", 	ДанныеКлиента["active"]);
			Структура.Вставить("IDучастия", 	Формат(ДанныеКлиента["id"],"ЧГ="));
			Структура.Вставить("ПЛ", 			"");
			Структура.Вставить("НомерКарты", 	ДанныеКлиента["cardNumber"]);
			Структура.Вставить("КоличествоБонусов",ДанныеКлиента["amount"]);
			Структура.Вставить("Уровень",		ДанныеКлиента["level"]["name"]);
			Структура.Вставить("ДатаСоздания", 	crm_RetailCRMОбщий.ПреобразоватьДатуCRM(ДанныеКлиента["createdAt"]));
			Структура.Вставить("ДатаАктивацииУчастия", crm_RetailCRMОбщий.ПреобразоватьДатуCRM(ДанныеКлиента["activatedAt"]));
			Структура.Вставить("IDКлиента", 	IDКлиента);
			Структура.Вставить("ДатаРождения", 	ДатаРождения);
			Структура.Вставить("Пол", 			Пол);
			Структура.Вставить("СуммаПокупок", 	"");
			Структура.Вставить("СуммаДоСледующегоУровня", "");
			Структура.Вставить("Почта", 		eMail);
		Иначе 
			Сообщить("Не удалось активировать клиента в ПЛ");
			
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаКлиенте
Процедура Зарегистрировать(Команда)
	
	СтруктураВозврата = ЗарегистрироватьНаСервере();
	ЭтаФорма.Закрыть(СтруктураВозврата);
	
КонецПроцедуры

